/*
 * grid.cc
 *
 * ‘ункции дл€ работы с расчетной сеткой.
 *
 * (c) ”ткин ѕавел, 2012
 *
 * —оздан: 27 €нвар€ 2012 г.
 *
 */

#include "grid.h"

#include "main.h"

/* ќпределение координат узлов и центров €чеек сетки
   x[N+1] - координаты узлов сетки (out)
   xc[N] - координаты центров €чеек сетки (out) */
void build_grid( double x[N+1], double xc[N] ) {

    int i;
    double h;	/* шаг расчетной сетки */
	
    /* равномерное распределение узлов сетки */
    h = 1.0 / N;
	
    /* координаты узлов */
    for ( i = 0; i < N + 1; i++ ) {
        x[i] = i * h;
    }

    /* координаты центров €чеек */
    for ( i = 0; i < N; i++ ) {
        xc[i] = 0.5 * ( x[i] + x[i+1] );
    }

}